Tekla Open API Reference for Tekla Structures 2025
DatabaseObject.GetDoubleUserProperties Method
Overload List
Name | Description
GetDoubleUserProperties(Dictionary<String, Double>)
 Retrieves all double user properties for the object with the given list of names.
GetDoubleUserProperties(List<String>, Dictionary<String, Double>)
 Retrieves all double user properties for the object with the given list of names.
Top
See Also
Reference
DatabaseObject Class
Tekla.Structures.Drawing Namespace